garyPenhook/PIC-Assembler/device_includes/pic16f13113.inc
// Register: LATA
#define LATA LATA
LATA                                     equ 0018h
// bitfield definitions
LATA_LATA0_POSN                          equ 0000h
LATA_LATA0_POSITION                      equ 0000h
LATA_LATA0_SIZE                          equ 0001h
LATA_LATA0_LENGTH                        equ 0001h
LATA_LATA0_MASK                          equ 0001h
LATA_LATA1_POSN                          equ 0001h
LATA_LATA1_POSITION                      equ 0001h
LATA_LATA1_SIZE                          equ 0001h
LATA_LATA1_LENGTH                        equ 0001h
LATA_LATA1_MASK                          equ 0002h
LATA_LATA2_POSN                          equ 0002h
LATA_LATA2_POSITION                      equ 0002h
LATA_LATA2_SIZE                          equ 0001h
LATA_LATA2_LENGTH                        equ 0001h
LATA_LATA2_MASK                          equ 0004h
LATA_LATA4_POSN                          equ 0004h
LATA_LATA4_POSITION                      equ 0004h
LATA_LATA4_SIZE                          equ 0001h
LATA_LATA4_LENGTH                        equ 0001h
LATA_LATA4_MASK                          equ 0010h
LATA_LATA5_POSN                          equ 0005h
LATA_LATA5_POSITION                      equ 0005h
LATA_LATA5_SIZE                          equ 0001h
LATA_LATA5_LENGTH                        equ 0001h
LATA_LATA5_MASK                          equ 0020h

// Register: PIR0
#define PIR0 PIR0
PIR0                                     equ 008Ch
// bitfield definitions
PIR0_INTF_POSN                           equ 0000h
PIR0_INTF_POSITION                       equ 0000h
PIR0_INTF_SIZE                           equ 0001h
PIR0_INTF_LENGTH                         equ 0001h
PIR0_INTF_MASK                           equ 0001h
PIR0_IOCIF_POSN                          equ 0004h
PIR0_IOCIF_POSITION                      equ 0004h
PIR0_IOCIF_SIZE                          equ 0001h
PIR0_IOCIF_LENGTH                        equ 0001h
PIR0_IOCIF_MASK                          equ 0010h
PIR0_TMR0IF_POSN                         equ 0005h
PIR0_TMR0IF_POSITION                     equ 0005h
PIR0_TMR0IF_SIZE                         equ 0001h
PIR0_TMR0IF_LENGTH                       equ 0001h
PIR0_TMR0IF_MASK                         equ 0020h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 008Dh
// bitfield definitions
PIR1_NVMIF_POSN                          equ 0000h
PIR1_NVMIF_POSITION                      equ 0000h
PIR1_NVMIF_SIZE                          equ 0001h
PIR1_NVMIF_LENGTH                        equ 0001h
PIR1_NVMIF_MASK                          equ 0001h
PIR1_CRCIF_POSN                          equ 0001h
PIR1_CRCIF_POSITION                      equ 0001h
PIR1_CRCIF_SIZE                          equ 0001h
PIR1_CRCIF_LENGTH                        equ 0001h
PIR1_CRCIF_MASK                          equ 0002h
PIR1_SCANIF_POSN                         equ 0002h
PIR1_SCANIF_POSITION                     equ 0002h
PIR1_SCANIF_SIZE                         equ 0001h
PIR1_SCANIF_LENGTH                       equ 0001h
PIR1_SCANIF_MASK                         equ 0004h
PIR1_CSWIF_POSN                          equ 0004h
PIR1_CSWIF_POSITION                      equ 0004h
PIR1_CSWIF_SIZE                          equ 0001h
PIR1_CSWIF_LENGTH                        equ 0001h
PIR1_CSWIF_MASK                          equ 0010h
PIR1_OSFIF_POSN                          equ 0005h
PIR1_OSFIF_POSITION                      equ 0005h
PIR1_OSFIF_SIZE                          equ 0001h
PIR1_OSFIF_LENGTH                        equ 0001h
PIR1_OSFIF_MASK                          equ 0020h
PIR1_TMR1IF_POSN                         equ 0006h
PIR1_TMR1IF_POSITION                     equ 0006h
PIR1_TMR1IF_SIZE                         equ 0001h
PIR1_TMR1IF_LENGTH                       equ 0001h
PIR1_TMR1IF_MASK                         equ 0040h
PIR1_TMR1GIF_POSN                        equ 0007h
PIR1_TMR1GIF_POSITION                    equ 0007h
PIR1_TMR1GIF_SIZE                        equ 0001h
PIR1_TMR1GIF_LENGTH                      equ 0001h
PIR1_TMR1GIF_MASK                        equ 0080h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 008Eh
// bitfield definitions
PIR2_TMR2IF_POSN                         equ 0002h
PIR2_TMR2IF_POSITION                     equ 0002h
PIR2_TMR2IF_SIZE                         equ 0001h
PIR2_TMR2IF_LENGTH                       equ 0001h
PIR2_TMR2IF_MASK                         equ 0004h
PIR2_CCP1IF_POSN                         equ 0005h
PIR2_CCP1IF_POSITION                     equ 0005h
PIR2_CCP1IF_SIZE                         equ 0001h
PIR2_CCP1IF_LENGTH                       equ 0001h
PIR2_CCP1IF_MASK                         equ 0020h
PIR2_CCP2IF_POSN                         equ 0006h
PIR2_CCP2IF_POSITION                     equ 0006h
PIR2_CCP2IF_SIZE                         equ 0001h
PIR2_CCP2IF_LENGTH                       equ 0001h
PIR2_CCP2IF_MASK                         equ 0040h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 008Fh

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 0090h
// bitfield definitions
PIR4_CLC1IF_POSN                         equ 0002h
PIR4_CLC1IF_POSITION                     equ 0002h
PIR4_CLC1IF_SIZE                         equ 0001h
PIR4_CLC1IF_LENGTH                       equ 0001h
PIR4_CLC1IF_MASK                         equ 0004h
PIR4_CLC2IF_POSN                         equ 0003h
PIR4_CLC2IF_POSITION                     equ 0003h
PIR4_CLC2IF_SIZE                         equ 0001h
PIR4_CLC2IF_LENGTH                       equ 0001h
PIR4_CLC2IF_MASK                         equ 0008h
PIR4_CLC3IF_POSN                         equ 0004h
PIR4_CLC3IF_POSITION                     equ 0004h
PIR4_CLC3IF_SIZE                         equ 0001h
PIR4_CLC3IF_LENGTH                       equ 0001h
PIR4_CLC3IF_MASK                         equ 0010h
PIR4_CLC4IF_POSN                         equ 0005h
PIR4_CLC4IF_POSITION                     equ 0005h
PIR4_CLC4IF_SIZE                         equ 0001h
PIR4_CLC4IF_LENGTH                       equ 0001h
PIR4_CLC4IF_MASK                         equ 0020h
PIR4_TX1IF_POSN                          equ 0006h
PIR4_TX1IF_POSITION                      equ 0006h
PIR4_TX1IF_SIZE                          equ 0001h
PIR4_TX1IF_LENGTH                        equ 0001h
PIR4_TX1IF_MASK                          equ 0040h
PIR4_RC1IF_POSN                          equ 0007h
PIR4_RC1IF_POSITION                      equ 0007h
PIR4_RC1IF_SIZE                          equ 0001h
PIR4_RC1IF_LENGTH                        equ 0001h
PIR4_RC1IF_MASK                          equ 0080h

